import time
meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "РОФЛ": "шутка",
            "ЩИЩ": "одобрение или восторг",
            "КРИПОВЫЙ": "страшный, пугающий",
            "АГРИТЬСЯ": "злиться",
            "АПРУВИТЬ": "утвердить",
            "АЧИВКА": "достижение",
            "БАЙТИТЬ": "копировать, красть чужое, заниматься плагиатом. Служить приманкой для кого-то, чего-то",
            "БАТТХЕРТ": "раздражение, обида",
            "ГАЗЛАЙТИНГ": "форма психологического насилия, при которой манипулятор отрицает произошедшие факты",
            "ДАУНЛОУДИТЬ": "захламлять память ненужным",
            "КОЛЛАБЫ": "коллективное",
            "КРАШ": "предмет обожания",
            "МАТЧИТЬСЯ": "подходить",
            "СВАЙПИТЬ": "смахнуть фото",
            "ОТФАКТЧЕКИТЬ": "соблюдать правило двух надежных источников",
            "ПУШИТЬ": "настойчиво торопить",
            "САСНЫЙ": "соблазнительный, симпатичный, сексуальный",
            "САММЭРИТЬ": "делать выводы",
            "ФАСИЛИТИРОВАТЬ": "упрощать, облегчать",
            "ФЕЙСПАЛМ": "лицо, прикрытое рукой. Жест разочарования и стыда",
            "ХЕЙТИТЬ": "ненавидеть",
            "ЧИЛИТЬ": "расслаблять",
            "ЧИТЕР": "жулик",
            "ЧСВ": "чувство собственной важности",
            "ШЕЙМИТЬ": "стыдить кого-либо",
            "ШИППЕРИТЬ": "представлять, что какие-то персонажи (книги, фильма, сериала, игры) или популярные люди состоят в романтических отношениях, хотя в действительности это не так",
            "СИМП": "Человек, очень сильно увлеченный, фанатеющий от кого-либо или чего-либо, симпающий на него",
            "СКАМ": "обман, афера, махинация",
            "СТЭНИТЬ": "Сходить с ума, фанатеть по кому-либо так же сильно, как герой трека и клипа Эминема 2000-го года по имени Стэн, одержимый своим кумиром (самим Эминемом)",
            "ТИЛЬТ": "От английского tilt — «наклон, крен, наклониться». Пришедшее из покера в геймерство и киберспорт, а оттуда — и в молодежную среду выражение. Обозначает состояние сильнейшего эмоционального потрясения игрока после проигрыша. «Я в тильте» — я в ужасном, плохом, злом настроении",
            "ТРЕШ": "От английского trash — «мусор, отбросы, хлам» — нечто безумное, дикое и «грязное». Например, треш-контент в сети.",
            "ФЛЕКСИТЬ": "От английского flex — «изгибать, поигрывать, разминать». В прямом значении — подергиваться в такт музыке. В более глубоком смысле — вести себя хвастливо, выпендриваться, словом «поигрывать мышцами».",
            "ФОРСИТЬ": "От английского force — «форсировать, принуждать». Прикладывать усилия для того, чтобы некая информация стала известна как можно более широкой аудитории. Форсить можно новость, событие, мем.",
            "ХАЙП": "От английского hype — «шумиха, ажиотаж». Действия человека (или группы людей), вызванные желанием, чтобы о нем узнали и заговорили любой ценой. Ценой, как правило, становятся нелицеприятные поступки, поэтому и хайп чаще всего бывает «грязным»",
            "ДЕДИНСАЙД": "Dead inside переводится как «мертвый внутри». Летом 2021 года эта фраза стала определением людей, которые погружены в свои эмоции, ничем не интересуются и постоянно грустят",
            "ПРУФ": "доказательство (англ.: proof). Самый популярный вопрос, который задают в комментариях под сенсационными новостями или шокирующими подробностями событий: «А где пруфы?»",
            "ДРОПНУТЬ": "глагол, у которого много разных значений в зависимости от того, кто и при каких обстоятельствах его использует. Самое популярное значение – бросить, перестать заниматься чем-либо. Для творческих людей «дропнуть» – значит опубликовать контент, выпустить в свет. В компьютерных играх этот термин используют, когда выбрасывают что-то из своего инвентаря, а в IT-сфере слово ассоциируется с отключением соединения или удалением программы",
            "ХЕЙТЕР": " с одной стороны, все просто: hate – ненависть, значит, хейтер – ненавистник. Но в современном мире хейтером называют человека, который не просто ненавидит что-то, но и готов тратить все свободное время и силы на выражение своих чувств",
            "ЖИЗА": "Используется как сокращение от слова «жизнь» и употребляется в значении «жизненная ситуация, с которой сталкивался лично»",
            "ОРАТЬ": " громко смеяться, хохотать во весь голос",
            "ТОКСИК": "человек, который настроен негативно, применяет психологическое насилие или вызывает отрицательные эмоции. Образовано от английского toxic – ядовитый, токсичный",
            "АКТУАЛОЧКА": "что-то актуальное, современное, трендовое",
            "АШАЛЕТЬ": "ничего себе, синоним слову обалдеть",
            "БАТОНИТЬСЯ": "валяться дома на диване, ничем не заниматься, лениво и расслабленно отдыхать",
            "БОДИШЕЙМИНГ": "осуждение или критика внешности или фигуры человека",
            "БОТАТЬ": "учиться",
            "ВАРИК": "вариант (по аналогии рестик – ресторан, падик – подъезд)",
            "ВЫПИЛИТЬ": "уничтожить, удалить что-либо",
            "ГИГАЧАД": "кто-то очень накаченный и крутой, однако встречается контекст издевки над “тупыми качками”",
            "ГОСТИТЬ": "игнорировать; прекращать общение с кем-либо, не предупредив человека",
            "ДВИЖ ПАРИЖ": "активные действия, веселье, развлечения, тусовки",
            "ДЕФОЛТ": "не меняющаяся ситуация",
            "ДИСС": "оскорбительная композиция или унизительные речевые высказывания, часто используемые в рэпе или подобных стилях",
            "АШКА": "электронная одноразовая сигарета (КУРЕНИЕ ВРЕДНО ДЛЯ ЗДОРОВЬЯ!!)",
            "ДУШНИЛА": "занудный, “душный” человек, с которым сложно общаться из-за его придирок, нудных тем для разговоров или постоянного осуждения",
            "ЖОСКО": "очень сильно, много, очень",
            "ЗАБИТЬ": "перестать заботиться о чем-то, не обращать внимания",
            "ЗАЛУТАТЬ": "получить, приобрести что-то ценное, особенно в контексте покупок или поиска предметов",
            "ЗАТАЩИТЬ": "суметь что-то сделать, особенно когда ситуация находилась на грани провала. Тащер - ценный игрок",
            "ЗАШЛО": "понравилось",
            "ИМПОСТЕР": "самозванец, обманщик, предатель",
            "КУН": "симпатичный парень",
            "ЛИВАТЬ": "покинуть, уйти или прервать что-то",
            "МАМОНТ": "человек, который устарел или не следит за современными трендами и технологиями",
            "МАСИК": "о мужчинах, на которых можно положиться. О спокойных, заботливых и эмоционально стабильных мужчинах",
            "МАТЧАСТЬ": "техническая, теоретическая сторона вопроса",
            "МЕРЧ": "продукция, связанная с каким-то брендом или артистом, которая продается для фанатов",
            "МОЯШКИНА": "так ласково называют лучшую подругу",
            "МУВ": "поступок, действие",
            "МУД": "настроение",
            "НЕФОР": "представитель неформального движения",
            "НОУНЕЙМ": "никому не известная личность, малоизвестный человек",
            "ОВЕРДОФИГА": "очень много",
            "ОЧКОШНИК": "человек, который боится",
            "ПАНЧ": "удачное высказывание. Пришло из рэпа, где слово означает фразу, высмеивающую соперника",
            "ПАСХАЛКА": "скрытая подсказка, отсылка на что либо",
            "ПИКАПИТЬ": "знакомиться с представителями противоположного пола с целью завязывания отношений",
            "ПОДКРАДУЛИ": "странная обувь (в плане дизайна)",
            "ПУСЬКА": "обозначает неженку, мягкотелого человека",
            "РУМТУР": "видео, в котором человек показывает свое жилище",
            "СЕЛЕБА": "знаменитость",
            "СИГМА": "так называют харизматичных, уверенных в себе мужчин",
            "СКИПНУТЬ": "пропустить",
            "СЛЭМИТЬ": "движение на концертах, при котором люди объединяются в круг и начинают прыгать друг на друга, толкать, врезаться, при этом двигаясь по кругу",
            "СУЕТОЛОГ": "тот, кто наводит суету, поднимает кипиш",
            "СЮР": "сюрреализм, что-то абсурдное и странное",
            "ТИШКА": "футболка",
            "ТЮБИК": "ненадежный партнер, который каким-либо образом разочаровал девушку. Так обычно говорят о ранимых, истеричных бывших",
            "ТЯН": "привлекательная девушка",
            "ФИЧА": "особенность. Также полезная функция программы (у программистов)",
            "ЧЕКАТЬ": "проверять",
            "ШАРИТЬ": "разбираться в чем-либо",
            "ЮЗАТЬ": "использовать, применять или эксплуатировать что-то",
            "ЯЖМАТЬ": "женщина, у которой есть ребенок/дети, считающая, что это ставит ее выше других. Обычно так называют женщин с детьми, которые думают, что им все можно и что все им что-то должны",
            "АБЬЮЗЕР": "человек, сознательно стремящийся подавить людей эмоционально или психологически. В отношениях это обычно тиран, а его партнер выступает в роли жертвы",
            "БУЛЛИНГ": "систематическое преследование, запугивание или издевательство над другими людьми, особенно в школьной или рабочей среде",
            "БОТ": "в общении и соцсетях: человек, который оставляет комментарии в социальных сетях за деньги",
            "ИНФОЦЫГАНЕ": "продажа информационных продуктов (курсов, тренингов и т.п.), которые не несут никакой реальной ценности"
            }
#Загрузка Системы
print("====================================================================================")
time.sleep(0.5)
print("ЗАГРУЗКА СИСТЕМЫ Phantom OS")
time.sleep(0.5)
print("====================================================================================")
time.sleep(0.5)
print("Загрузка.")
time.sleep(0.5)
print("Загрузка..")
time.sleep(0.5)
print("Загрузка...")
time.sleep(0.5)
print("Загрузка.")
time.sleep(0.5)
print("Загрузка..")
time.sleep(0.5)
print("Загрузка...")
time.sleep(0.5)
print("====================================================================================")
time.sleep(0.5)
print("Добро пожаловать в программу объяснялку современных слов!")
time.sleep(0.5)
while True:
    #Начало программы
    time.sleep(1)
    word = input("Введите непонятное вам современное слово (БОЛЬШИМИ БУКВАМИ!): ")
    
    if word in meme_dict.keys():
        print(meme_dict[word])
    else:
        print('Ничего не нашлось')
